app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages` ORDER BY name

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 3) ORDER BY name

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`name`, `created_at`, `updated_at`) VALUES('taco_land', '2010-10-08 18:34:42', '2010-10-08 18:34:42')