app/controllers/site_vars_controller.rb

SELECT * FROM `sites` ORDER BY name LIMIT 1
SELECT * FROM `site_site_vars` WHERE (site_id = 7 AND site_var_id = 4) LIMIT 1
SELECT * FROM `site_vars`
SELECT * FROM `sites` WHERE (`sites`.`id` = 7) ORDER BY name
SELECT * FROM `site_vars` WHERE (`site_vars`.`id` = 4)
---
  def index
    @sites = site_list_plus_default
    @site_vars = site_vars
    @_sites = Site.all
    @_site_vars = SiteVar.all

    unless params[:site].blank?
      unless params[:site] == "0"
        @site = Site.find(params[:site])
      else # a little hackery to get around the fact that our default site can't be looked up
        @site = Site.new
        @site.id = 0
      end
    end
    unless params[:site_var].blank?
      @site_var = SiteVar.find(params[:site_var])

SELECT * FROM `site_vars` WHERE (`site_vars`.`id` = 5)
---
  def show
    @site_var = SiteVar.find(params[:id])

INSERT INTO `site_vars` (`name`, `created_at`, `updated_at`) VALUES('types_of_cheese', '2010-10-08 18:33:05', '2010-10-08 18:33:05')
---
  def create
    @site_var = SiteVar.new(params[:site_var])

    respond_to do |format|
      if @site_var.save

SELECT * FROM `site_site_vars` WHERE (`site_site_vars`.site_var_id = 5)
SELECT * FROM `site_vars` WHERE (`site_vars`.`id` = 5)
DELETE FROM `site_site_vars` WHERE `id` = 8
DELETE FROM `site_vars` WHERE `id` = 5
---
  def destroy
    @site_var = SiteVar.find(params[:id])
    @site_var.destroy

SELECT * FROM `site_site_vars` WHERE (site_id = 0 AND site_var_id = 4) LIMIT 1
SELECT * FROM `site_vars` WHERE (`site_vars`.`id` = 4)
SELECT * FROM `sites` WHERE (`sites`.`id` = 0) ORDER BY name
INSERT INTO `site_site_vars` (`site_var_id`, `created_at`, `updated_at`, `value`, `site_id`) VALUES(4, '2010-10-08 18:24:08', '2010-10-08 18:24:08', NULL, 0)
SELECT * FROM `sites` ORDER BY name LIMIT 1
UPDATE `site_site_vars` SET `updated_at` = '2010-10-08 18:24:08', `value` = 'booyaw' WHERE `id` = 7
---
  def update_site_var

    # site = Site.find(params[:site])
    # site_var = SiteVar.find(params[:site_var])
    #value = params[:value]

    site_site_var = SiteSiteVar.find( :first,
                                      :conditions => ["site_id = ? AND site_var_id = ?", params[:site], params[:site_var]])
    site_site_var = SiteSiteVar.create(:site_id => params[:site], :site_var_id => params[:site_var]) if site_site_var.nil?

    site_site_var.value = params[:value]
    site_site_var.save!