app/controllers/sites_controller.rb

SELECT * FROM `sites` ORDER BY name
---
  def index
    @sites = Site.all

SELECT * FROM `sites` WHERE (`sites`.`id` = 7) ORDER BY name
SELECT * FROM `pages` WHERE (`pages`.`id` = 1) ORDER BY name
SELECT * FROM `pages_sites` WHERE (`pages_sites`.site_id = 7)
SELECT * FROM `sites` ORDER BY name
SELECT `pages`.* FROM `pages` INNER JOIN `pages_sites` ON `pages`.id = `pages_sites`.page_id WHERE ((`pages_sites`.site_id = 7)) ORDER BY name
SELECT count(*) AS count_all FROM `pages_sites` WHERE (`pages_sites`.site_id = 7)
---
  def edit_pages
    @site = Site.find(params[:id])
    @pages = Page.find(:all)
    @sites = Site.find(:all)

    #arrays to populate js arrays which in turn populate the pagesource dialog's dropdowns
    @dialog_sites = Site.find(:all)

    @dialog_pages = []
    Site.find(:all).each do |site|
      pages = []
      site.ordered_pages_sites.each { |ps| pages << {:id => ps.page.id, :name => ps.page.name} if ps.self_referential? }

SELECT * FROM `sites` WHERE (`sites`.`id` = 7) ORDER BY name
SELECT * FROM `pages` WHERE (`pages`.`id` = 2) ORDER BY name
SELECT `pages_sites`.id FROM `pages_sites` WHERE (`pages_sites`.`site_id` = 7 AND `pages_sites`.page_id = 2) LIMIT 1
INSERT INTO `pages_sites` (`created_at`, `updated_at`, `page_id`, `page_source_id`, `protected`, `site_id`) VALUES('2010-10-08 17:49:42', '2010-10-08 17:49:42', 2, NULL, 0, 7)
---
  def associate_page

    @site = Site.find(params[:id])
    @page = Page.find(params[:page][:id])

    #check to make sure page is not already associated

    _ps = PagesSite.find(:first, :conditions => ["page_id = ? AND site_id = ?", @page, @site])
    if _ps.nil?
      ps =  PagesSite.create(:site => @site, :page => @page)

SELECT * FROM `sites` WHERE (`sites`.`id` = 7) ORDER BY name
SELECT * FROM `pages_sites` WHERE (`pages_sites`.`id` = 4)
DELETE FROM `pages_sites` WHERE `id` = 4
SELECT * FROM `sites` ORDER BY name
SELECT `pages`.* FROM `pages` INNER JOIN `pages_sites` ON `pages`.id = `pages_sites`.page_id WHERE ((`pages_sites`.site_id = 7)) ORDER BY name
---
  def remove_page
    @site = Site.find(params[:id])
    @pages_site = PagesSite.find(params[:pages_site_id])
    @pages_site.destroy
    Changelog.add(@current_user.login, "Removed the #{@pages_site.page.name} page from the #{@site.name} site")

SELECT * FROM `sites` WHERE (`sites`.`id` = 8) ORDER BY name
SELECT * FROM `pages` WHERE (`pages`.`id` = 1) ORDER BY name
SELECT * FROM `sites` ORDER BY name
SELECT `pages_sites`.id FROM `pages_sites` WHERE (`pages_sites`.`site_id` = 8 AND `pages_sites`.page_id = 1 AND `pages_sites`.id <> 2) LIMIT 1
---
  def modify_pages_site

    # find the pages_sites record that is associate with our page/site
    # create find the PageSource that represents new destination
    # add or remoave a pagesource to the pages_sites record
    # twiddle the protected flag

    # PROTECTED FLAG

    protected = false
    unless params[:ps_page_protected].blank?
      protected = params[:ps_page_protected] == "1"
    end

    # PAGE SOURCE

    @site = Site.find(params[:id])
    pagesource_page = Page.find(params[:ps_page]) unless params[:ps_page].blank?
    pagesource_site = Site.find(params[:ps_site][:id]) unless params[:ps_site][:id].blank?

    page_page = Page.find(params[:ps_form_page_id])
    page_site = @site

    # if either pagesource_page or pagesource_site is blank, then remove the pagesource from the page_sites
    if pagesource_page.blank? or pagesource_site.blank?
      pagesource = nil
    else
      pagesource = PageSource.find(:first, :conditions => ["page_id = ? AND site_id = ?", pagesource_page, pagesource_site])
    end

    page = PagesSite.find(:first, :conditions => ["page_id = ? AND site_id = ?", page_page, page_site])

SELECT `pages`.* FROM `pages` INNER JOIN `pages_sites` ON `pages`.id = `pages_sites`.page_id WHERE ((`pages_sites`.site_id = 7)) ORDER BY name
---
    page.page_source = pagesource
    page.save!

    flash[:notice] = "The source for the #{@site.name} #{page.page.name} page has been changed"

SELECT * FROM `sites` WHERE (`sites`.`id` = 8) ORDER BY name
SELECT * FROM `pages` WHERE (`pages`.`id` = 1) ORDER BY name
---
  def quick_lookup_file_location
    site = Site.find(params[:site_id])
    page = Page.find(params[:page_id])

SELECT * FROM `sites` WHERE (`sites`.`id` = 7) ORDER BY name
---
  def status
    site = Site.find(params[:id])