app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`name`, `single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `user_role_id`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('Billy Corgan', 'MQ76NPIEtjZ0JHyY9IFO', NULL, '2010-05-27 17:24:20', '742a5339091db5aa6995b6e021ddb04e135de818b77b91d8a675fb24bec84c8c1c827e0a8376189dd453893b1d794d20fed3941601214a8742b07874a26f4a8b', 'ZQ6wwfdcGLMtUw7IFrA0', '2010-05-27 17:24:20', 0, NULL, '6XrXHvgI5ZoDxG_HS9PJ', NULL, 'c1a25c5102fb46c8a7ad920e30028885869c9d9178380dcdd19ad3e619c2cd15768203c1a589ad75c66b5cf73634854b994464d8f4b57701e839c35e4ba8fc51', 0, 381803025, NULL, 'billy', NULL, 'billy@corgan.com')
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save